#language: ru

@tree

Функционал: Проверка заполнения организации в документе Заказ покупателя

Как Менеджер по продажам я хочу
проверить автоматическое заполнение организации из соглашения,
чтобы при необходимости заполнить организацию вручную

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка заполнения организации

    И я закрываю все окна клиентского приложения
    Дано Я открываю навигационную ссылку "e1cib/list/Document.SalesOrder"
    И я нажимаю на кнопку с именем 'FormCreate'

    // Выбираем партнера и соглашение
    И я нажимаю кнопку выбора у поля с именем 'Partner'
    Когда открылось окно "Партнеры"
    И в таблице 'List' я перехожу к строке:
    	| "Код" | "Наименование"       |
    	| "5"   | "Клиент и поставщик" |
    И я нажимаю на кнопку с именем 'FormChoose'
    И из выпадающего списка с именем 'Agreement' я выбираю по строке "Соглашение с клиентами (расчет по документам + кредитный лимит)"
	Когда открылось окно "Табличная часть товаров будет обновлена"
    И я нажимаю на кнопку с именем 'FormOK'
    // Проверяем, заполнилась ли организация
    Если элемент формы с именем "Company" стал равен '' Тогда
        И из выпадающего списка с именем 'Company' я выбираю по строке "Собственная компания 1"

    // Проверяем итоговое заполнение
    Тогда элемент формы с именем "Company" стал равен "Собственная компания 1"
