#language: ru

@tree

Функционал: <описание фичи>

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: <описание сценария>
	И я запоминаю текущее окно как "ЗаголовокОкнаПоступленияТоваров"
	И я вывожу значение переменной "ЗаголовокОкнаПоступленияТоваров"
	Когда открылось окно "Поступление товаров и услуг * от *"
	И я нажимаю на кнопку с именем 'FormReportDocumentRegistrationsReportRegistrationsReport'
	Тогда открылось окно "Движения документа"
	И из выпадающего списка с именем 'FilterRegister' я выбираю точное значение "R1001 Закупки"
	И я нажимаю на кнопку с именем 'GenerateReport'
	Тогда табличный документ 'ResultTable' равен:
		| '$ЗаголовокОкнаПоступленияТоваров$' | ''                   | ''           | ''      | ''                  | ''             | ''                       | ''                          | ''                             | ''       | ''                                                        | ''                        | ''                                     | ''                  |
		| 'Движения документа по регистрам'                         | ''                   | ''           | ''      | ''                  | ''             | ''                       | ''                          | ''                             | ''       | ''                                                        | ''                        | ''                                     | ''                  |
		| 'Регистр  "R1001 Закупки"'                                | ''                   | ''           | ''      | ''                  | ''             | ''                       | ''                          | ''                             | ''       | ''                                                        | ''                        | ''                                     | ''                  |
		| ''                                                        | 'Period'             | 'Resources'  | ''      | ''                  | ''             | 'Dimensions'             | ''                          | ''                             | ''       | ''                                                        | ''                        | ''                                     | 'Attributes'        |
		| ''                                                        | ''                   | 'Количество' | 'Сумма' | 'Сумма без налогов' | 'Сумма скидки' | 'Организация'            | 'Структурное подразделение' | 'Вид мультивалютной аналитики' | 'Валюта' | 'Инвойс'                                                  | 'Характеристика'          | 'Ключ строки'                          | 'Отложенный расчет' |
		| ''                                                        | '16.10.2026 0:00:09' | '1'          | ''      | ''                  | ''             | 'Собственная компания 1' | ''                          | 'В валюте бюджетирования'      | 'EUR'    | 'Поступление товаров и услуг 1 002 от 16.10.2026 0:00:09' | 'Товар без характеристик' | '1ed33aaf-17c8-4b59-bf23-ed29cac8e0ff' | 'Да'                |
		| ''                                                        | '16.10.2026 0:00:09' | '1'          | ''      | ''                  | ''             | 'Собственная компания 1' | ''                          | 'В валюте бюджетирования'      | 'EUR'    | 'Поступление товаров и услуг 1 002 от 16.10.2026 0:00:09' | 'Услуга'                  | 'b2ff1cb4-6d15-4d2f-8202-69e256ceccf4' | 'Да'                |
		| ''                                                        | '16.10.2026 0:00:09' | '1'          | '85,9'  | '71,58'             | ''             | 'Собственная компания 1' | ''                          | 'В локальной валюте страны'    | 'EUR'    | 'Поступление товаров и услуг 1 002 от 16.10.2026 0:00:09' | 'Товар без характеристик' | '1ed33aaf-17c8-4b59-bf23-ed29cac8e0ff' | 'Нет'               |
		| ''                                                        | '16.10.2026 0:00:09' | '1'          | '100'   | '83,33'             | ''             | 'Собственная компания 1' | ''                          | 'ru наименование не заполнено' | 'USD'    | 'Поступление товаров и услуг 1 002 от 16.10.2026 0:00:09' | 'Товар без характеристик' | '1ed33aaf-17c8-4b59-bf23-ed29cac8e0ff' | 'Нет'               |
		| ''                                                        | '16.10.2026 0:00:09' | '1'          | '100'   | '83,33'             | ''             | 'Собственная компания 1' | ''                          | 'В валюте отчетности'          | 'USD'    | 'Поступление товаров и услуг 1 002 от 16.10.2026 0:00:09' | 'Товар без характеристик' | '1ed33aaf-17c8-4b59-bf23-ed29cac8e0ff' | 'Нет'               |
		| ''                                                        | '16.10.2026 0:00:09' | '1'          | '100'   | '83,33'             | ''             | 'Собственная компания 1' | ''                          | 'Валюта соглашения, USD'       | 'USD'    | 'Поступление товаров и услуг 1 002 от 16.10.2026 0:00:09' | 'Товар без характеристик' | '1ed33aaf-17c8-4b59-bf23-ed29cac8e0ff' | 'Нет'               |
		| ''                                                        | '16.10.2026 0:00:09' | '1'          | '171,8' | '143,17'            | ''             | 'Собственная компания 1' | ''                          | 'В локальной валюте страны'    | 'EUR'    | 'Поступление товаров и услуг 1 002 от 16.10.2026 0:00:09' | 'Услуга'                  | 'b2ff1cb4-6d15-4d2f-8202-69e256ceccf4' | 'Нет'               |
		| ''                                                        | '16.10.2026 0:00:09' | '1'          | '200'   | '166,67'            | ''             | 'Собственная компания 1' | ''                          | 'ru наименование не заполнено' | 'USD'    | 'Поступление товаров и услуг 1 002 от 16.10.2026 0:00:09' | 'Услуга'                  | 'b2ff1cb4-6d15-4d2f-8202-69e256ceccf4' | 'Нет'               |
		| ''                                                        | '16.10.2026 0:00:09' | '1'          | '200'   | '166,67'            | ''             | 'Собственная компания 1' | ''                          | 'В валюте отчетности'          | 'USD'    | 'Поступление товаров и услуг 1 002 от 16.10.2026 0:00:09' | 'Услуга'                  | 'b2ff1cb4-6d15-4d2f-8202-69e256ceccf4' | 'Нет'               |
		| ''                                                        | '16.10.2026 0:00:09' | '1'          | '200'   | '166,67'            | ''             | 'Собственная компания 1' | ''                          | 'Валюта соглашения, USD'       | 'USD'    | 'Поступление товаров и услуг 1 002 от 16.10.2026 0:00:09' | 'Услуга'                  | 'b2ff1cb4-6d15-4d2f-8202-69e256ceccf4' | 'Нет'               |
	
		
		
Сценарий: глобальные переменные
	И я закрываю все окна клиентского приложения
	И я удаляю переменную '$$СсылкаТовараБезХарактеристик$$'
	И я сохраняю навигационную ссылку текущего окна в переменную "$$СсылкаТовараБезХарактеристик$$"
	И Я открываю навигационную ссылку "$$СсылкаТовараБезХарактеристик$$"
	