#language: ru

@tree
@Заказ покупателя

Функционал: проверка заполнения полей документа Заказ покупателя

Как Тестировщик я хочу
проверить заполнение полей Партнер и Соглашение, а также доступность поля Контрагент,
чтобы убедиться в корректной работе формы документа   

Контекст:
	Дано Я открыл новый сеанс TestClient или подключил уже существующий

Сценарий: Проверка заполнения полей "Партнер" и "Соглашение" и блокировки поля "Контрагент"
	
		И я закрываю все окна клиентского приложения
		Дано Я открываю навигационную ссылку "e1cib/list/Document.SalesOrder"
		И я нажимаю на кнопку с именем 'FormCreate'

		Тогда элемент формы с именем 'Partner' стал равен ''
    	И элемент формы с именем 'LegalName' не доступен

		И я нажимаю кнопку выбора у поля с именем 'Partner'
		И в таблице 'List' я перехожу к строке:
			| 'Наименование'       |
			| 'Розничный клиент 1' |
		И в таблице 'List' я выбираю текущую строку
		Тогда элемент формы с именем 'Partner' стал равен 'Розничный клиент 1'
		И элемент формы с именем 'LegalName' доступен

		И я нажимаю кнопку выбора у поля с именем 'Agreement'
		И в таблице 'List' я перехожу к строке:
			| 'Наименование'       |
			| 'Розничный клиент 1' |
    	И в таблице 'List' я выбираю текущую строку
    	Тогда элемент формы с именем 'Agreement' стал равен 'Розничный клиент 1'
        
		И я закрываю все окна клиентского приложения

