#language: ru

@tree

Функционал: проверка отображения возвратов в отчете D2001 Продажи

Как Тестировщик я хочу
проверить отображение возвратов в отчете D2001 Продажи
чтобы убедиться в корректном учете возвратов при формировании отчета 

Контекст:
    Дано Я открыл новый сеанс TestClient или подключил уже существующий

Сценарий: подготовка данных для проверки возвратов
	Когда экспорт основных данных
	Когда экспорт документов возврат товаров от покупателя
	И я выполняю код встроенного языка на сервере
		|'Документы.SalesReturn.НайтиПоНомеру(1).ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);'|
		
Сценарий: проверка отчета по продажам
	И я закрываю все окна клиентского приложения
	И В командном интерфейсе я выбираю "Отчеты" "D2001 Продажи"
	Тогда открылось окно "D2001 Продажи"
	И я нажимаю на кнопку с именем 'FormGenerate'
	И я жду когда в табличном документе "Result" заполнится ячейка "R11C3" в течение 20 секунд
	Дано Табличный документ "Result" равен макету "ВозвратТоваровОтПокупателя1" по шаблону	